In [91]:
import pandas as pd

In [3]:
df = pd.read_csv('Pandas-Tutorial/RegularSeasonCompactResults.csv')
df.head()

   Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
0    1985      20   1228      81   1328      64    N      0
1    1985      25   1106      77   1354      70    H      0
2    1985      25   1112      63   1223      56    H      0
3    1985      25   1165      70   1432      54    H      0
4    1985      25   1192      86   1447      74    H      0

In [14]:
df.tail()

        Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
145284    2016     132   1114      70   1419      50    N      0
145285    2016     132   1163      72   1272      58    N      0
145286    2016     132   1246      82   1401      77    N      1
145287    2016     132   1277      66   1345      62    N      0
145288    2016     132   1386      87   1433      74    N      0

In [13]:
df.describe()

,Season,Daynum,Wteam,Wscore,Lteam,Lscore,Numot
count,145289.000000,145289.000000,145289.000000,145289.000000,145289.000000,145289.000000,145289.000000
mean,2001.574834,75.223816,1286.720646,76.600321,1282.864064,64.497009,0.044387
std,9.233342,33.287418,104.570275,12.173033,104.829234,11.380625,0.247819
min,1985.000000,0.000000,1101.000000,34.000000,1101.000000,20.000000,0.000000
25%,1994.000000,47.000000,1198.000000,68.000000,1191.000000,57.000000,0.000000
50%,2002.000000,78.000000,1284.000000,76.000000,1280.000000,64.000000,0.000000
75%,2010.000000,103.000000,1379.000000,84.000000,1375.000000,72.000000,0.000000
max,2016.000000,132.000000,1464.000000,186.000000,1464.000000,150.000000,6.000000

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 145289 entries, 0 to 145288
Data columns (total 8 columns):
Season    145289 non-null int64
Daynum    145289 non-null int64
Wteam     145289 non-null int64
Wscore    145289 non-null int64
Lteam     145289 non-null int64
Lscore    145289 non-null int64
Wloc      145289 non-null object
Numot     145289 non-null int64
dtypes: int64(7), object(1)
memory usage: 8.9+ MB

In [12]:
display(type(df['Season']), type(df[['Season']]))

pandas.core.series.Series

pandas.core.frame.DataFrame

In [9]:
mask = (df['Season'] > 1985)
df[mask].head()

      Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
3737    1986      24   1181      66   1249      62    N      0
3738    1986      24   1412      71   1401      68    N      0
3739    1986      25   1133      94   1260      84    A      0
3740    1986      25   1197      88   1126      70    N      0
3741    1986      25   1208      78   1418      75    A      0

In [10]:
mask = (df[['Season']]>1985)
df[mask].head()

   Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
0     NaN     NaN    NaN     NaN    NaN     NaN  NaN    NaN
1     NaN     NaN    NaN     NaN    NaN     NaN  NaN    NaN
2     NaN     NaN    NaN     NaN    NaN     NaN  NaN    NaN
3     NaN     NaN    NaN     NaN    NaN     NaN  NaN    NaN
4     NaN     NaN    NaN     NaN    NaN     NaN  NaN    NaN

In [17]:
df.loc[:,['Wscore','Numot']].head()

   Wscore  Numot
0      81      0
1      77      0
2      63      0
3      70      0
4      86      0

In [18]:
df.shape

(145289, 8)

In [19]:
df.index

RangeIndex(start=0, stop=145289, step=1)

In [20]:
df.columns

Index(['Season', 'Daynum', 'Wteam', 'Wscore', 'Lteam', 'Lscore', 'Wloc',
       'Numot'],
      dtype='object')

In [21]:
df.columns.tolist()

['Season', 'Daynum', 'Wteam', 'Wscore', 'Lteam', 'Lscore', 'Wloc', 'Numot']

In [22]:
display(df.max(), df.min())

Season    2016
Daynum     132
Wteam     1464
Wscore     186
Lteam     1464
Lscore     150
Wloc         N
Numot        6
dtype: object

Season    1985
Daynum       0
Wteam     1101
Wscore      34
Lteam     1101
Lscore      20
Wloc         A
Numot        0
dtype: object

In [23]:
type(df.max())

pandas.core.series.Series

In [24]:
df['Wscore'].max()

186

In [25]:
df['Lscore'].mean()

64.49700940883343

In [26]:
df['Lscore'].std()

11.380624668827176

In [28]:
df['Wscore'].argmax()

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning:
The current behaviour of 'Series.argmax' is deprecated, use 'idxmax'
instead.
The behavior of 'argmax' will be corrected to return the positional
maximum in the future. For now, use 'series.values.argmax' or
'np.argmax(np.array(values))' to get the position of the maximum
row.
  """Entry point for launching an IPython kernel.

24970

In [47]:
df['Wscore'].idxmax()

24970

In [29]:
df['Wscore'].max()

186

In [45]:
mask = df['Wscore']
mask[24970]

186

In [46]:
a = mask >=186
df[a]

       Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
24970    1991      68   1258     186   1109     140    H      0

In [50]:
df.iloc[[df['Wscore'].idxmax()]]

       Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
24970    1991      68   1258     186   1109     140    H      0

In [55]:
df.iloc[[df['Wscore'].idxmax()]]["Lscore"]

24970    140
Name: Lscore, dtype: int64

In [57]:
df.iloc[[df['Wscore'].idxmax()]]["Lscore"][24970]

140

In [58]:
df.iloc[0:3]

   Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
0    1985      20   1228      81   1328      64    N      0
1    1985      25   1106      77   1354      70    H      0
2    1985      25   1112      63   1223      56    H      0

In [64]:
df.loc[:3]

   Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
0    1985      20   1228      81   1328      64    N      0
1    1985      25   1106      77   1354      70    H      0
2    1985      25   1112      63   1223      56    H      0
3    1985      25   1165      70   1432      54    H      0

In [65]:
df.loc[df['Wscore'].idxmax(), 'Lscore']

140

In [68]:
df.sort_values('Wscore').tail()

       Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
20022    1990      40   1116     166   1109     101    H      0
24341    1991      47   1328     172   1258     112    H      0
19653    1990      30   1328     173   1109     101    H      0
17867    1989      92   1258     181   1109     150    H      0
24970    1991      68   1258     186   1109     140    H      0

In [69]:
a = df.groupby('Lscore')

In [75]:
df[a]

       Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
24970    1991      68   1258     186   1109     140    H      0

In [76]:
df[df['Wscore']>150].head()

       Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
5269     1986      75   1258     151   1109     107    H      0
12046    1988      40   1328     152   1147      84    H      0
12355    1988      52   1328     151   1173      99    N      0
16040    1989      40   1328     152   1331     122    H      0
16853    1989      68   1258     162   1109     144    A      0

In [77]:
df[(df['Wscore']>150) & (df['Lscore']<100)]

       Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
12046    1988      40   1328     152   1147      84    H      0
12355    1988      52   1328     151   1173      99    N      0
25656    1991      84   1106     151   1212      97    H      0
28687    1992      54   1261     159   1319      86    H      0
35023    1993     112   1380     155   1341      91    A      0
52600    1998      33   1395     153   1410      87    H      0

In [80]:
df.groupby('Wteam')['Wscore'].mean().head()

Wteam
1101    78.111111
1102    69.893204
1103    75.839768
1104    75.825944
1105    74.960894
Name: Wscore, dtype: float64

In [88]:
df.groupby('Wteam')['Wloc'].value_counts().head(9)

Wteam  Wloc
1101   H        12
       A         3
       N         3
1102   H       204
       A        73
       N        32
1103   H       324
       A       153
       N        41
Name: Wloc, dtype: int64

In [90]:
df.values

array([[1985, 20, 1228, ..., 64, 'N', 0],
       [1985, 25, 1106, ..., 70, 'H', 0],
       [1985, 25, 1112, ..., 56, 'H', 0],
       ...,
       [2016, 132, 1246, ..., 77, 'N', 1],
       [2016, 132, 1277, ..., 62, 'N', 0],
       [2016, 132, 1386, ..., 74, 'N', 0]], dtype=object)

In [83]:
df[(df['Wteam']==1101)]

        Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
131950    2014      75   1101      73   1146      72    H      0
132860    2014      94   1101      87   1223      81    H      0
135619    2015      31   1101      72   1170      61    H      0
136263    2015      49   1101      65   1354      59    N      0
136343    2015      50   1101      69   1115      61    N      0
136740    2015      62   1101      87   1146      70    H      0
136953    2015      68   1101      71   1311      54    H      0
137131    2015      71   1101      95   1322      81    A      0
139440    2015     120   1101      83   1223      71    H      0
140642    2016      25   1101      72   1197      62    N      0
141972    2016      61   1101      62   1146      61    A      0
142481    2016      71   1101      87   1322      72    H      0
142816    2016      78   1101      75   1270      67    H      0
143283    2016      89   1101      80   1249      71    H      0
143476    2016      92   1101      79   1223      72    H      0
143783    2016      98   1101      71   1249      67    A      0
144430    2016     111   1101      91   1368      80    H      0
144622    2016     117   1101      87   1309      84    H      0

In [92]:
df.values

array([[1985, 20, 1228, ..., 64, 'N', 0],
       [1985, 25, 1106, ..., 70, 'H', 0],
       [1985, 25, 1112, ..., 56, 'H', 0],
       ...,
       [2016, 132, 1246, ..., 77, 'N', 1],
       [2016, 132, 1277, ..., 62, 'N', 0],
       [2016, 132, 1386, ..., 74, 'N', 0]], dtype=object)

In [93]:
df.values[0][0]

1985

In [95]:
for index, row in df.iterrows():
    print(row)
    if index == 1:
        break

Season    1985
Daynum      20
Wteam     1228
Wscore      81
Lteam     1328
Lscore      64
Wloc         N
Numot        0
Name: 0, dtype: object
Season    1985
Daynum      25
Wteam     1106
Wscore      77
Lteam     1354
Lscore      70
Wloc         H
Numot        0
Name: 1, dtype: object

In [97]:
df[['Wscore','Lscore']].head()

   Wscore  Lscore
0      81      64
1      77      70
2      63      56
3      70      54
4      86      74

In [101]:
df.loc[:,['Wscore','Lscore']].head()

   Wscore  Lscore
0      81      64
1      77      70
2      63      56
3      70      54
4      86      74

In [102]:
type(df['Wscore'])

pandas.core.series.Series

In [103]:
type(df[['Wscore']])

pandas.core.frame.DataFrame

In [104]:
df[0:3]

   Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
0    1985      20   1228      81   1328      64    N      0
1    1985      25   1106      77   1354      70    H      0
2    1985      25   1112      63   1223      56    H      0

In [105]:
df.iloc[0:3,1]

0    20
1    25
2    25
Name: Daynum, dtype: int64

In [108]:
df.isnull().sum()

Season    0
Daynum    0
Wteam     0
Wscore    0
Lteam     0
Lscore    0
Wloc      0
Numot     0
dtype: int64